docker/load-user/test2.yaml
config:
    target: "{{ $processEnvironment.SOCKET_ADDRESS }}"
    processor: "./my-function.js"
    phases:
      - duration: "{{ $processEnvironment.DURATION }}"
        arrivalRate: "{{ $processEnvironment.USERS }}"
scenarios:
    - engine: "ws"
      flow:
       - function: "gameMock"
       - send: "{{ data }}"
       - think: 1